latex/ProbabilityTheoryAComprehensiveCourse/ProbabilityTheoryAComprehensiveCourse.tex
% Created 2020-04-24 五 14:02
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{imakeidx}
\usepackage{hyperref}
\usepackage{minted}
\input{preamble.tex}
\author{Achim Klenke}
\date{\today}
\title{\aunclfamily\Huge Probability Theory\\ A \\Comprehensive Course}
\hypersetup{
 pdfauthor={Achim Klenke},
 pdftitle={\aunclfamily\Huge Probability Theory\\ A \\Comprehensive Course},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.3.6)}, 
 pdflang={English}}
\begin{document}

\maketitle \clearpage
\tableofcontents \clearpage\section{Basic Measure Theory}
\label{sec:orgea0c38c}
\subsection{Classes of Sets}
\label{sec:orgff5ba97}
\begin{definition}[]
A class of sets \(\cala\) is called
\begin{itemize}
\item \textbf{\(\cap\)-closed} or a \textbf{\(\pi\)-system} if \(A\cap B\in\cala\) whenever \(A,B\in\cala\)
\item \textbf{\(\sigma\text{-}\cap\)-closed} (closed under countable intersection)
\item \textbf{\(\cup\)-closed} (closed under unions)
\item \textbf{\(\sigma\text{-}\cup\)-closed}
\item \textbf{\textbackslash-closed}
\item closed under complements
\end{itemize}
\end{definition}

\begin{definition}[$\sigma$-algebra]
A class of sets \(\cala\subset 2^{\Omega}\) is called a \textbf{\(\sigma\)-algebra} if it
fullills the following three conditions
\begin{enumerate}
\item \(\Omega\in\cala\)
\item \(\cala\) is closed under complements
\item \(\cala\) is closed under countable unions
\end{enumerate}
\end{definition}


\begin{theorem}[]
If \(\cala\) is closed under complements, then we have the equivalence
\begin{align*}
\cala\text{ is }\cap\text{-closed}\quad&\Longleftrightarrow\quad\cala\text{ is }
\cup\text{-closed}\\
\cala\text{ is }\sigma\text{-}\cap\text{-closed}\quad&\Longleftrightarrow\quad\cala\text{ is }
\sigma\text{-}\cup\text{-closed}
\end{align*}
\end{theorem}

\begin{theorem}[]
\label{thm1.4}
Assume that \(\cala\) is \textbackslash-closed. Then the following statements hold:
\begin{enumerate}
\item \(\cala\) is \(\cup\)-closed
\item If in addition \(\cala\) is \(\sigma\text{-}\cup\)-closed, then \(\cala\) is 
\(\sigma\text{-}\cup\)-closed
\item Any countable (repectively finite) union of sets in \(\cala\) can be
expressed as a countable (respectively finite) disjoint union of sets in \(\cala\)
\end{enumerate}
\end{theorem}

\begin{proof}
\begin{enumerate}
\setcounter{enumi}{2}
\item Assume that \(A_1,A_2,\dots\in\cala\)
\begin{equation*}
\displaystyle\bigcup_{n=1}^\infty A_n=A_1\uplus(A_2\textbackslash
A_1)\uplus((A_3\textbackslash
A_2)\textbackslash A_1)\uplus\dots
\end{equation*}
\end{enumerate}
\end{proof}

\begin{definition}[]
A class of sets \(\cala\subset 2^\Omega\) is called an \textbf{algebra} if the
following three conditions are fulfilled
\begin{enumerate}
\item \(\Omega\in\cala\)
\item \(\cala\) is \textbackslash-closed
\item \(\cala\) is \(\cup\)-closed
\end{enumerate}
\end{definition}

\begin{theorem}[]
A class of sets \(\cala\subset2^\Omega\) is an algebra if and only if the
following  three properties hold
\begin{enumerate}
\item \(\Omega\in\cala\)
\item \(\cala\) is closed under complements
\item \(\cala\) is closed under intersections
\end{enumerate}
\end{theorem}

\begin{definition}[]
A class of sets \(\cala\subset2^\Omega\) is called a \textbf{ring} if the following
conditions hold
\begin{enumerate}
\item \(\emptyset\in\cala\)
\item \(\cala\) is \textbackslash-closed
\item \(\cala\) is \(\cup\)-closed
\end{enumerate}
\end{definition}


\begin{definition}[]
A class of sets \(\cala\subset2^\Omega\) is called a \textbf{semiring} if
\begin{enumerate}
\item \(\emptyset\in\cala\)
\item for any two sets \(A,B\in\cala\) the difference set \(B\textbackslash A\) is a
finite union of mutually disjoint sets in \(\cala\)
\item \(\cala\) is \(\cap\)-closed
\end{enumerate}
\end{definition}

\begin{definition}[]
A class of sets \(\cala\subset2^\Omega\) is called a \textbf{\(\lambda\)-system} if
\begin{enumerate}
\item \(\Omega\in\cala\)
\item for any two sets \(A,B\in\cala\) with \(A\subset B\), \(B\textbackslash A\in\cala\)
\item \(\biguplus_{n=1}^\infty A_n\in\cala\) for any choice of countably many
pairwise disjoint sets \(A_1,\dots\in\cala\)
\end{enumerate}
\end{definition}

\begin{theorem}[]
\begin{enumerate}
\item Every \(\sigma\)-algebra also is a \(\lambda\)-system, an algebra and a
\(\sigma\)-ring
\item Every \(\sigma\)-ring is a ring, and every ring is a semiring
\item Every algebra is a ring. An algebra on a finite set \(\Omega\) is a \(\sigma\)-algebra
\end{enumerate}
\end{theorem}

\begin{definition}[liminf and limsup]
Let \(A_1,A_2,\dots\) be a subset of \(\Omega\). The sets
\begin{equation*}
\liminf_{n\to\infty}A_n:=\displaystyle\bigcup_{n=1}^\infty
\bigcap_{m=n}^\infty A_m\hspace{1.5cm}
\limsup_{n\to\infty}A_n:=\bigcap_{n=1}^\infty\bigcup_{m=n}^\infty
A_m
\end{equation*}
are called \textbf{limes inferior} and \textbf{limes superior}, respectively, of the sequence
\((A_n)_{n\in\N}\)
\end{definition}

\begin{remark}
\begin{enumerate}
\item lim\hspace{0.03cm}inf and lim\hspace{0.03cm}sup can be rewritten as
\begin{align*}
\liminf_{n\to\infty}A_n&=\{\omega\in\Omega:\#\{n\in\N:\omega\not\in A_n\}<\infty\}\\
\limsup_{n\to\infty}A_n&=\{\omega\in\Omega:\#\{n\in\N:\omega\in A_n\}=\infty\}
\end{align*}
In other words, limes inferior is the event where \textbf{eventually all} of the
\(A_n\) occur. On the other hand, limes superior is the event where
\textbf{infinitely many} of the \(A_n\) occur. In particular,
\(A_*:=\liminf_{n\to\infty}A_n\subset A^*:=\limsup_{n\to\infty}A_n\)
\item We define the \textbf{indicator function} on the set \(A\) by
\begin{equation*}
\mathbbm{1}_A(x):=
\begin{cases}
1,&x\in A\\
0,&x\not\in A
\end{cases}
\end{equation*}
With this notation 
\begin{equation*}
\mathbbm{1}_{A_*}=\liminf_{n\to\infty}\mathbbm{1}_{A_n}\quad\text{and}\quad
\mathbbm{1}_{A^*}=\limsup_{n\to\infty}\mathbbm{1}_{A_n}
\end{equation*}
\item If \(\cala\subset2^\Omega\) is a \(\sigma\)-algebra and if \(A_n\in\cala\) for
every \(n\in\N\), then \(A_*\in\cala\) and \(A^*\in\cala\)
\end{enumerate}
\end{remark}

\begin{theorem}[Intersection of classes of sets]
Let \(I\) be an arbitrary index set, and assume that \(\cala_i\) is a
\(\sigma\)-algebra for every \(i\in I\). Hence the intersection
\begin{equation*}
\cala_I:=\{A\subset\Omega:A\in\cala_i\text{ for every }i\in I\}=
\displaystyle\bigcap_{i\in I}\cala_i
\end{equation*}
is a \(\sigma\)-algebra. The analogous statement holds for rings, \(\sigma\)-rings,
algebras and \(\lambda\)-systems. However, it fails for semirings
\end{theorem}

\begin{theorem}[Generated $\sigma$-algebra]
Let \(\cale\subset2^\Omega\). Then there exists a smallest \(\sigma\)-algebra 
\(\sigma(\cale)\) with \(\cale\subset\sigma(\cale)\)
\begin{equation*}
\sigma(\cale):=\displaystyle\bigcap_{\substack{\cala\subset2^\Omega
\text{ is a }\sigma\text{-algebra}\\\cala\supset\cale}}\cala
\end{equation*}
\(\sigma(\cale)\) is called the \(\sigma\)-algebra generated by \(\cale\). \(\cale\) is
called a generator of \(\sigma(\cale)\). Similarly, we define \(\delta(\cale)\)
as the \(\lambda\)-system generated by \(\cale\)
\end{theorem}

\begin{remark}
The following three statements hold 
\begin{enumerate}
\item \(\cale\subset\sigma(\cale)\)
\item If \(\cale_1\subset\cale_2\), then \(\sigma(\cale_1)\subset\sigma(\cale_2)\)
\item \(\cala\) is a \(\sigma\)-algebra if and only if \(\sigma(\cala)=\cala\)
\end{enumerate}
\end{remark}

\begin{theorem}[$\cap$-closed $\lambda$-system]
\label{thm1.18}
Let \(\cald\subset2^\Omega\) be a \(\lambda\)-system. Then 
\begin{equation*}
\cald\text{ is a }\pi\text{-system}\quad\Longleftrightarrow\quad
\cald\text{ is a }\sigma\text{-algebra}
\end{equation*}
\end{theorem}

\begin{proof}
"\(\Longrightarrow\)"
\begin{enumerate}
\setcounter{enumi}{2}
\item Let \(A,B\in\cald\). By assumption, \(A\cap B\in\cald\) and trivially
\(A\cap B\subset A\). Thus \(A\textbackslash B=A\textbackslash(A\cap
      B)\in\cald\). This implies that \(\cald\) is \textbackslash-closed. Thus by
Theorem \ref{thm1.4}, works.
\end{enumerate}
\end{proof}


\begin{theorem}[Dynkin's $\pi$-$\lambda$ theorem]
If \(\cale\subset2^\Omega\) is a \(\pi\)-system, then
\begin{equation*}
\sigma(\cale)=\delta(\cale)
\end{equation*}
\end{theorem}

\begin{proof}
\begin{enumerate}
\item \(\supseteq\). \(A^c=\Omega\textbackslash A\).
\item \(\subseteq\). By Theorem \ref{thm1.18}, it is enough to show that
\(\delta(\cale)\) is a \(\pi\)-system. For any \(B\in\delta(\cale)\) define
\begin{equation*}
\cald_B:=\{A\in\delta(\cale):A\cap B\in\delta(\cale)\}
\end{equation*}
In order to show that \(\delta(\cale)\) is a \(\pi\) system, it is enough to
show that 
\begin{equation*}
\delta(\cale)\subset\cald_B\quad\text{for any }B\in\delta(\cale)
\end{equation*}

\(\cald_E\) is a \(\lambda\)-system
\begin{enumerate}
\item \(\Omega\cap E=E\in\delta(\cale)\). Hence \(\Omega\in\cald_E\)
\item For any \(A,B\in\cald_E\) with \(A\subset B\), we have 
\((B\textbackslash A)\cap E=(B\cap E)\textbackslash(A\cap E)\in\delta(E)\)
\item Assume that \(A_1,\dots,\in\cald_E\) are mutually disjoint. Hence
\begin{equation*}
\left(\displaystyle\bigcup_{n=1}^\infty\right)\cap E=
\biguplus_{n=1}^\infty(A_n\cap E)\in\delta(\cale)
\end{equation*}
\end{enumerate}
\end{enumerate}


By assumption, \(A\cap E\in\cale\) if \(A,E\in\cale\); thus
\(\cale\subset\cale_E\) if \(E\in\cale\). Hence
\(\delta(\cale)\subset\delta(\cald_E)=\cald_E\) for any \(E\in\cale\). Hence we
get that \(B\cap E\in\delta(\cale)\) for any \(B\in\delta(\cale)\) and
\(E\in\cale\). This implies that \(E\in\cale_B\) for any
\(B\in\delta(\cale)\). Thus \(\cale\subset\cald_B\) for any
\(B\in\delta(\cale)\). 
\end{proof}
\end{document}